Repository: vikbert/design-pattern-php8
Catalog: locale/*/LC_MESSAGES/Behavioral/NullObject/README.po
Languages: es, it, zh_cn

source: `Null Object`__
zh_cn: `空对象模式`__

source: Purpose
es: Propósito
it: Scopo
zh_cn: 目的

source: NullObject is not a GoF design pattern but a schema which appears frequently enough to be considered a pattern. It has the following benefits:
es: NullObject no es un patrón GoF pero es un esquema bastante frecuente como para ser considerado patrón. Tiene los siguientes beneficios:
it: NullObject non è un pattern della GoF ma uno schema che appare frequentemente da essere considerato tale. Possiede i seguenti vantaggi:
zh_cn: 空对象模式不是一个GoF设计模式，但是它出现非常频繁足以被认为是设计模式。它的好处如下：

source: Client code is simplified
es: Código cliente simplificado
it: Il codice del client è semplificato
zh_cn: 简化客户端代码

source: Reduces the chance of null pointer exceptions
es: Reduce las posibilidades de excepciones null pointer
it: Riduce il rischio di null pointer exceptions
zh_cn: 减少空指针异常的次数

source: Fewer conditionals require less test cases
es: Menos condicionales requieren menos tests
it: Meno espressioni condizionali richiedono meno casi di test
zh_cn: 减少测试用例的复杂性

source: Methods that return an object or null should instead return an object or ``NullObject``. ``NullObject``\ s simplify boilerplate code such as ``if (!is_null($obj)) { $obj->callSomething(); }`` to just ``$obj->callSomething();`` by eliminating the conditional check in client code.
es: Métodos que devuelven un objeto o un valor nulo deben devolver un objeto o ``NullObject``. ``NullObject``\ simplificar el código repetitivo como ``if (!is_null($obj)) { $obj->callSomething(); }`` a solo ``$obj->callSomething();`` eliminando la verificación condicional en el código cliente.
it: I metodi che restituisco un oggetto o null dovrebbero invece restituire l'oggetto o il ``NullObject``. Questi ``NullObjects`` semplificano il codice cosicchè ``if (!is_null($obj)) { $obj->callSomething() ; }`` con il seguente ``$obj->callSomething() ;`` eliminado il controllo condizionale nel codice del client.
zh_cn: 返回一个对象或null的方法应该返回一个对象或NullObject。NullObjects简化了样板代码，如if (!is_null($obj)) {$obj->callSomething();}只需要$obj->callSomething();通过消除客户端代码中的条件签入。

source: Examples
es: Ejemplos
it: Esempi
zh_cn: 例子

source: Null logger or null output to preserve a standard way of interaction between objects, even if the shouldn't do anything
es: Null logger o salida null para preservar una forma estándar de interacción entre objetos, incluso si este no debiera hacer nada
zh_cn: Null logger或Null输出以保持对象之间交互的标准方式，即使他们不做任何事情

source: null handler in a Chain of Responsibilities pattern
es: manejador null en un patrón Chain of Responsibilities
it: Null handler in un pattern di Chain of Responsabilities
zh_cn: 责任链模式中的空处理程序

source: null command in a Command pattern
es: comando null en un patrón Command
it: Null command in un Command pattern
zh_cn: 命令模式中的空命令

source: UML Diagram
es: Diagrama UML
it: Diagramma UML
zh_cn: UML 图

source: Code
es: Código
it: Codice
zh_cn: 代码

source: You can also find this code on `GitHub`_
es: Puedes encontrar el código en `GitHub`_
it: Potete trovare questo codice anche su `GitHub`_
zh_cn: 在 `GitHub`_ 上查看代码

source: Test
zh_cn: 测试

source: null logger or null output to preserve a standard way of interaction between objects, even if the shouldn't do anything
it: Null logger o null output per preservare una procedura standard di interazione tra oggetti anche se non eseguono niente.
