Repository: vikbert/design-pattern-php8
Catalog: locale/*/LC_MESSAGES/Structural/Facade/README.po
Languages: es, it

source: Purpose
es: Propósito
it: Scopo

source: The primary goal of a Facade Pattern is not to avoid you having to read the manual of a complex API. It's only a side-effect. The first goal is to reduce coupling and follow the Law of Demeter.
es: El objetivo principal del Patrón Facade (o Patrón Fachada) no es evitar que tenga que leer el manual de una compleja API. Es solo un efecto secundario. El primer objetivo es reducir el acoplamiento y seguir la Ley de Demeter.
it: L'obiettivo primario del patten Facade non è evitare di dover leggere il manuale di un API complessa. Questo è un effetto collaterale. Il pattern permette di ridurre l'accoppiamento e seguire la Legge di Demetra.

source: A Facade is meant to decouple a client and a sub-system by embedding many (but sometimes just one) interface, and of course to reduce complexity.
es: Una Fachada está destinada a desacoplar un cliente y un subsistema al incorporar muchas (pero a veces solo una) interfaz y, por supuesto, reducir la complejidad.
it: Una Facade si occupa di disaccopiare il client a un sottositema includendo molte (ma a vole solo una) interfacce riducendo la complessità

source: A facade does not forbid you the access to the sub-system
es: Una fachada no le prohíbe el acceso al subsistema
it: Un facade non proibisce di accedere al sottosistema

source: You can (you should) have multiple facades for one sub-system
es: Puede (debería) tener múltiples fachadas para un subsistema
it: Si possono avere facade multiple per un unico sottosistema

source: That's why a good facade has no ``new`` in it. If there are multiple creations for each method, it is not a Facade, it's a Builder or a [Abstract\|Static\|Simple] Factory [Method].
es: Por eso una buena fachada no tiene ``new`` en ella. Si hay varias creaciones para cada método, no es una fachada, es un Builder (Constructor) o una [Abstract\|Static\|Simple] Factory [Method].
it: Ecco perchè la Facade non ha ``new`` al suo interno, Se ci fossero creazioni multiple per ogni metodo, non sarebbe più una facade, ma un Builder o un [Abstract|Static|Simple] Factory.

source: The best facade has no ``new`` and a constructor with interface-type-hinted parameters. If you need creation of new instances, use a Factory as argument.
es: La mejor fachada no tiene ``new`` y un constructor con parámetros interfaz-type-hinted. Si necesita crear nuevas instancias, utilice Factory como argumento.
it: La miglior facade non ha un ``new`` e un costruttore con parametri tipizzati. Se si necessita di creare nuove istanze, utilizzare una Factory come parametro.

source: UML Diagram
es: Diagrama UML
it: Diagramma UML

source: Code
es: Código
it: Codice

source: You can also find this code on `GitHub`_
es: Puedes encontrar el código en `GitHub`_
it: Potete trovare questo codice anche su `GitHub`_
