Repository: vikbert/design-pattern-php8
Catalog: locale/*/LC_MESSAGES/Behavioral/Command/README.po
Languages: es, it, zh_cn

source: `Command`__
zh_cn: `命令行模式`__

source: Purpose
es: Propósito
it: Scopo
zh_cn: 目的

source: To encapsulate invocation and decoupling.
es: Encapsular la invocación y desacoplar.
it: Incapsulare l'invocazione e il disaccoppiamento.
zh_cn: 封装调用与解耦

source: We have an Invoker and a Receiver. This pattern uses a "Command" to delegate the method call against the Receiver and presents the same method "execute". Therefore, the Invoker just knows to call "execute" to process the Command of the client. The Receiver is decoupled from the Invoker.
es: Tenemos un Invocador y un Receptor. Este patrón usa un "Command" para delegar la llamada al método en el Receptor y presenta el mismo método "execute". Por tanto, el Invocador simplemente debe saber llamar a "execute"para procesar el Command del cliente. El Receptor se desacopla del Invocador.
it: Abbiamo un Invoker e un Receiver. Questo pattern usa il "Command" per delegare le chiamate ai metodi verso il Receiver e mostrare il metodo "execute" unificato. Inoltre l' Invoker sa solo che deve chiamare il metodo "execute" per eseguire il Command del client. Il Receiver è disaccoppiato dall'Invoker.
zh_cn: 我们有一个调用器和一个接受器。此模式使用一个【Command】来委托接收器的方法调用，并呈现相同的方法【execute】。调用器只知道调用【execute】来处理客户机的【Command】。从而实现了接收器和调用者的解耦。

source: The second aspect of this pattern is the undo(), which undoes the method execute(). Command can also be aggregated to combine more complex commands with minimum copy-paste and relying on composition over inheritance.
es: El segundo aspecto de este patrón es el undo(), que deshace el métodoexecute(). El comando también se puede añadir para realizar combinaciones más complejas de comandos con un mínimo de copia-pega y depender de la composición antes que de la herencia.
it: Il secondo aspetto di questo pattern è che il metodo ``undo()`` permette di annullare il metodo ``execute()``. I comandi possono esssere accorpati per creare uno più complesso con pochissimi copia-incolla preferendo la composizione invece dell'ereditarietà.
zh_cn: 此模式的另一个方面是undo()，它取消execute()方法。命令行也可以通过聚合来组合更复杂的命令，使用最小的复制-粘贴，并依赖组合而不是继承。

source: Examples
es: Ejemplos
it: Esempi
zh_cn: 例子

source: A text editor : all events are commands which can be undone, stacked and saved.
it: Un editor di testo: tutti gli eventi sono Command i quali possono essere annullati, impilati e salvati.
zh_cn: 文本编辑器：所有事件都可以撤销、堆放、保存的命令。

source: big CLI tools use subcommands to distribute various tasks and pack them in "modules", each of these can be implemented with the Command pattern (e.g. vagrant)
es: Las grandes herramientas CLI utilizan subcomandos para distribuir varias tareas y empaquetarlas en " módulos ", cada uno de estos se puede implementar con el patrón Command (por ejemplo, vagrant)
it: Alcuni strumenti da riga di comando utilizzano sottocomandi per distribuire diversi task e impacchettarli in "moduli" ognuno dei quali implementato con il pattern Command (come ad esempio Vagrant).
zh_cn: 大型CLI工具使用子命令来分发各种任务，并将它们打包到【模块】，每个模块都可以用命令行模式实现例如【vagrant】。

source: UML Diagram
es: Diagrama UML
it: Diagramma UML
zh_cn: UML 图

source: Code
es: Código
it: Codice
zh_cn: 代码

source: You can also find this code on `GitHub`_
es: Puedes encontrar el código en `GitHub`_
it: Potete trovare questo codice anche su `GitHub`_
zh_cn: 在 `GitHub`_ 上查看代码

source: Test
zh_cn: 测试

source: A text editor : all events are Command which can be undone, stacked and saved.
es: Un editor de texto: todos los eventos son comandos que pueden deshacerse, apilarse y guardarse.
