Repository: vikbert/design-pattern-php8
Catalog: locale/*/LC_MESSAGES/Behavioral/Memento/README.po
Languages: es, it, zh_cn

source: `Memento`__
zh_cn: `备忘录模式`__

source: Purpose
es: Propósito
it: Scopo
zh_cn: 目的

source: It provides the ability to restore an object to it's previous state (undo via rollback) or to gain access to state of the object, without revealing it's implementation (i.e., the object is not required to have a function to return the current state).
it: Permette di ripristinare lo stato precedenti di un oggetto (annullamento tramite rollback) o di ottenere accesso allo stato di quest'ultimo senza rivelarne l'implementazione (ad esempio all'oggetto non è richiesta una funzione per restituire il suo stato corrente).
zh_cn: 它提供了将对象恢复到之前状态（通过回滚撤销）或访问对象状态的能力，而不需要揭示它的实现（对象不需要具有返回当前状态的函数）。

source: The memento pattern is implemented with three objects: the Originator, a Caretaker and a Memento.
es: El patrón Memento se implementa con tres objetos: el Originador, el Conserje y el Memento.
it: Il pattern Memento è implementato con tre oggetti: Originator, Caretaker e Memento.
zh_cn: memento模式由三个对象实现：Originator, Caretaker, Memento。

source: Memento – an object that *contains a concrete unique snapshot of state* of any object or resource: string, number, array, an instance of class and so on. The uniqueness in this case does not imply the prohibition existence of similar states in different snapshots. That means the state can be extracted as the independent clone. Any object stored in the Memento should be *a full copy of the original object rather than a reference* to the original object. The Memento object is a "opaque object" (the object that no one can or should change).
es: Memento - un objeto que *contiene una instantánea concreta y única del estado*de cualquier objeto o recurso: cadena, número, array, una instancia de clasey así sucesivamente. La singularidad en este caso no implica la prohibición de la existencia de estados similares en diferentes instantáneas. Eso significa que el estado se puede extraer como clon independiente. Cualquier objeto almacenado en Memento debe ser *una copia completa del objeto original en lugar de unreferencia* al objeto original. El objeto Memento es un "objeto opaco" (el objeto que nadie puede ni debe cambiar).
it: Memento - oggetto contenente *un'istantanea concreta ed unica dello stato* di un oggetto o di una risorsa: stringhe, numeri, array, istanze di una classe e così via. Unicità dello stato non implica l'inesistenza di stati simili in diffenti instantanee. Questo comporta che lo stato può essere estratto come un clone indipendente. Qualunque oggetto memorizzato nel Memento potrebbe essere una *copia completa dell'oggetto originale invece di un riferimento*. L'oggetto Memento è un "oggetto opaco" (che può o dovrebbe cambiare).
zh_cn: Memento – 包含任何对象或资源状态的具体唯一快照的对象：字符串、数字、数组、类的实例等。 这种情况下的唯一性并不意味着禁止在不同的快照中存在相似的状态。 这意味着可以将状态提取为独立克隆。 存储在 Memento 中的任何对象都应该是原始对象的完整副本，而不是对原始对象的引用。 Memento 对象是一个“不透明对象”（没有人可以或不应该更改的对象）。

source: Originator – it is an object that contains the *actual state of an external object is strictly specified type*. Originator is able to create a unique copy of this state and return it wrapped in a Memento. The Originator does not know the history of changes. You can set a concrete state to Originator from the outside, which will be considered as actual. The Originator must make sure that given state corresponds the allowed type of object. Originator may (but not should) have any methods, but they *they can't make changes to the saved object state*.
es: Originador: es un objeto que contiene el *estado actual de un objeto externo de tipo estrictamente especificado*. El originador puede crear una copia única de este estado y la devuelve envuelta en un Memento. El Originador no conoce el historial de cambios. Puede establecer un estado concreto para el Originador desde el exterior, que se considerará como actual. El Originador debe asegurar que el estado dado corresponda al tipo de objeto permitido. El originador puede (pero no debería) tener cualquier método, pero *no pueden realizar cambios en el estado del objeto guardado*.
it: Originator - oggetto contenente lo *stato attuale di un oggetto esterno di uno specifico tipo*.L'Originator è in grado di creare una copia unica di questo stato e restituirlo incapsulato in un Memento. Non conosce lo storico dei cambiamenti di stato. Potete assegnargli uno stato concreto dall'esterno rendendolo così quello attuale. L'Originator deve assicurarsi che lo stato assegnatosia compatibile con quello permesso dal tipo di oggetto. Può (ma non dovrebbe) avere qualche metodo ma non *possono effettuare cambiamenti allo stato dell'oggetto salvato*.
zh_cn: Originator—它是一个包含外部对象实际状态的对象，是严格指定的类型。Originator能够创建此状态的唯一副本，并将其包裹在Memento中返回。 Originator不知道变化的历史。 您可以从外部将具体状态设置为Originator，这将被视为实际状态。 Originator必须确保给定的状态对应于允许的对象类型。Originator可能（但不应该）有任何方法，但他们不能对保存的对象状态进行更改。

source: Caretaker *controls the states history*. He may make changes to an object; take a decision to save the state of an external object in the Originator; ask from the Originator snapshot of the current state; or set the Originator state to equivalence with some snapshot from history.
es: El Conserje *controla el historial de estados*. Puede realizar cambios en un objeto; tomar la decisión de guardar el estado de un objeto externo en el Originador; preguntar desde la instantánea del Originador del estado actual; o establecer el Estado del Originador a la equivalencia con alguna instantánea de la historia.
it: Caretaker - *controlla lo storico degli stati*. Può effettuare dei cambiamenti all'oggetto, decidere se salvare lo stato di un oggetto esterno nell'Originator, chiedere a quest'ultimo un'istantanea dello stato corrente o cambiare lo stato corrente dell'Originator con uno dello storico delle instantanee.
zh_cn: Caretaker控制着状态的历史。 他可以对一个对象进行更改； 决定在Originator中保存外部对象的状态；从当前状态的Originator快照中询问； 或将Originator状态设置为与历史记录中的某些快照等效。

source: Examples
es: Ejemplos
it: Esempi
zh_cn: 例子

source: The seed of a pseudorandom number generator
es: La semilla de un generador de números pseudoaleatorios
it: Il seme di un generatore numerico pesudocasuale
zh_cn: 发送一个随机数

source: The state in a finite state machine
es: El estado de una máquina de estado finita
it: Lo stato di una macchina a stati finiti
zh_cn: 并将这个随机数存在时序机中

source: Control for intermediate states of `ORM Model <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ before saving
es: Control para estados intermedios del `Modelo ORM https://es.wikipedia.org/wiki/Asignaci%C3%B3n_objeto-relacional` _ antes de guardar
it: Controllare gli stati intermedi di un `Modello ORM` <http://en.wikipedia.org/wiki/Object-relational_mapping>` prima di persisterlo
zh_cn: 保存之前控制 ORM Model 中的状态

source: UML Diagram
es: Diagrama UML
it: Diagramma UML
zh_cn: UML 图

source: Code
es: Código
it: Codice
zh_cn: 代码

source: You can also find this code on `GitHub`_
es: Puedes encontrar el código en `GitHub`_
it: Potete trovare questo codice anche su `GitHub`_
zh_cn: 在 `GitHub`_ 上查看代码

source: Test
zh_cn: 测试

source: It provides the ability to restore an object to it's previous state (undo via rollback) or to gain access to state of the object, without revealing it's implementation (i.e., the object is not required to have a functional for return the current state).
es: Proporciona la capacidad de restaurar un objeto a su estado anterior (deshacermediante rollback) o para obtener acceso al estado del objeto, sin revelar su implementación (es decir, no es necesario que el objeto tenga una función para devolver el estado actual).
